def solution(x):
    first_digit = x % 10
    '''
    залишок від ділення 3-значного числа на 10 - завжди остання цифра числа або нуль
    '''
    second_digit = x // 10 % 10
    '''
    ділення 3-значного числа без залишку на 10 -  завжди повертає перші дві цифри числа;
    далі отримуємо залишок від ділення отриманого двозначного числа
    '''
    third_digit = x // 100
    '''
    ділення 3-значного числа без залишку на 100 - завжди повертає першу цифру числа
    '''
    revert_value = int(str(first_digit) + str(second_digit) + str(third_digit))
    return revert_value


numbers = []
for i in range(100, 1000):
    numbers.append(i)
    '''
    масив тестових значень
    '''

for x in numbers:
    print(f"{x}:{solution(x)}")
    '''
    друк оригінальних і "перевернутих" значень
    '''
